[
  {
    "name": "The Great Aerie",
    "text": "When you planeswalk to The Great Aerie and at the beginning of your upkeep, bolster 3. (Choose a creature with the least toughness among creatures you control and put three +1/+1 counters on it.)\nWhenever chaos ensues, choose up to one target creature you control and up to one target creature an opponent controls. Each of those creatures deals damage equal to its toughness to the other.",
    "type": "Plane — Tarkir",
    "image_uri": "https://cards.scryfall.io/normal/front/4/a/4afe8c95-efeb-4f7d-834d-fa5b095c9a06.jpg?1680815458"
  },
  {
    "name": "Strixhaven",
    "text": "Instant and sorcery spells players cast have demonstrate. (Whenever a player casts an instant or sorcery spell, they may copy it. If they do, they choose an opponent to also copy it. Players may choose new targets for their copies.)\nWhenever chaos ensues, return up to one target instant or sorcery card from a graveyard to its owner's hand.",
    "type": "Plane — Arcavios",
    "image_uri": "https://cards.scryfall.io/normal/front/6/a/6a8a8752-6849-4abc-9acb-bafffe685e94.jpg?1680815492"
  },
  {
    "name": "Horizon Boughs",
    "text": "All permanents untap during each player's untap step.\nWhenever chaos ensues, you may search your library for up to three basic land cards, put them onto the battlefield tapped, then shuffle.",
    "type": "Plane — Pyrulea",
    "image_uri": "https://cards.scryfall.io/normal/front/6/1/61471ab4-749a-40e4-b06b-153edec80daa.jpg?1547432323"
  },
  {
    "name": "Murasa",
    "text": "Whenever a nontoken creature enters the battlefield, its controller may search their library for a basic land card, put it onto the battlefield tapped, then shuffle.\nWhenever chaos ensues, target land becomes a 4/4 creature that's still a land.",
    "type": "Plane — Zendikar",
    "image_uri": "https://cards.scryfall.io/normal/front/4/6/46daa243-7c4e-4b0c-8ec2-e70cba8e72c3.jpg?1547432171"
  },
  {
    "name": "New Argive",
    "text": "Whenever a historic creature you control attacks, it gets +2/+2 until end of turn. (Artifacts, legendaries, and Sagas are historic.)\nWhenever chaos ensues, reveal cards from the top of your library until you reveal a historic card. Put that card into your hand and the rest on the bottom of your library in a random order.",
    "type": "Plane — Dominaria",
    "image_uri": "https://cards.scryfall.io/normal/front/e/2/e22ac94f-03a7-49ee-a059-fc123708962e.jpg?1680815475"
  },
  {
    "name": "Selesnya Loft Gardens",
    "text": "If an effect would create one or more tokens, it creates twice that many of those tokens instead.\nIf an effect would put one or more counters on a permanent, it puts twice that many of those counters on that permanent instead.\nWhenever chaos ensues, until end of turn, whenever you tap a land for mana, add one mana of any type that land produced.",
    "type": "Plane — Ravnica",
    "image_uri": "https://cards.scryfall.io/normal/front/e/a/ea1537e5-b1a8-4735-acd4-9df627a8946c.jpg?1680815564"
  },
  {
    "name": "Towashi",
    "text": "Modified creatures you control have trample and \"Whenever this creature deals combat damage to a player or planeswalker, draw a card.\" (Equipment, Auras you control, and counters are modifications.)\nWhenever chaos ensues, distribute three +1/+1 counters among one, two, or three target creatures you control.",
    "type": "Plane — Kamigawa",
    "image_uri": "https://cards.scryfall.io/normal/front/6/d/6d37cf73-e128-4367-b030-313d987fda7a.jpg?1681345506"
  },
  {
    "name": "Littjara",
    "text": "When you planeswalk to Littjara and at the beginning of your upkeep, create a 2/2 blue Shapeshifter creature token with changeling. (It is every creature type.)\nWhenever chaos ensues, choose a creature type. Put a +1/+1 counter on each creature you control of that type.",
    "type": "Plane — Kaldheim",
    "image_uri": "https://cards.scryfall.io/normal/front/2/a/2a098e3b-00e7-48d5-bc0d-f153e7cc5dfd.jpg?1680881378"
  },
  {
    "name": "Llanowar",
    "text": "All creatures have \"{T}: Add {G}{G}.\"\nWhenever chaos ensues, untap all creatures you control.",
    "type": "Plane — Dominaria",
    "image_uri": "https://cards.scryfall.io/normal/front/0/0/00832a47-dec8-411e-9708-b3ebbd3a2dfc.jpg?1547432491"
  },
  {
    "name": "Turri Island",
    "text": "Creature spells cost {2} less to cast.\nWhenever chaos ensues, reveal the top three cards of your library. Put all creature cards revealed this way into your hand and the rest into your graveyard.",
    "type": "Plane — Ir",
    "image_uri": "https://cards.scryfall.io/normal/front/7/0/70d12cff-ba93-4673-832c-f9261c1501cd.jpg?1680815582"
  },
  {
    "name": "The Fourth Sphere",
    "text": "At the beginning of your upkeep, sacrifice a nonblack creature.\nWhenever chaos ensues, create a 2/2 black Zombie creature token.",
    "type": "Plane — Phyrexia",
    "image_uri": "https://cards.scryfall.io/normal/front/d/e/decef464-d1d3-4459-a1c4-fbad684d5d02.jpg?1547432413"
  },
  {
    "name": "Academy at Tolaria West",
    "text": "At the beginning of your end step, if you have no cards in hand, draw seven cards.\nWhenever chaos ensues, discard your hand.",
    "type": "Plane — Dominaria",
    "image_uri": "https://cards.scryfall.io/normal/front/e/d/ed4f4210-9871-4cec-9b46-100c80f93cd4.jpg?1645050357"
  },
  {
    "name": "Furnace Layer",
    "text": "When you planeswalk to Furnace Layer or at the beginning of your upkeep, select target player at random. That player discards a card. If that player discards a land card this way, they lose 3 life.\nWhenever chaos ensues, you may destroy target nonland permanent.",
    "type": "Plane — New Phyrexia",
    "image_uri": "https://cards.scryfall.io/normal/front/d/8/d89133d1-06e7-4b8f-8f42-e0551fd93a5b.jpg?1547432505"
  },
  {
    "name": "Grixis",
    "text": "Blue, black, and/or red creature cards in your graveyard have unearth. The unearth cost is equal to the card's mana cost. (Pay the card's mana cost: Return it to the battlefield. The creature gains haste. Exile it at the beginning of the next end step or if it would leave the battlefield. Unearth only as a sorcery.)\nWhenever chaos ensues, put target creature card from a graveyard onto the battlefield under your control.",
    "type": "Plane — Alara",
    "image_uri": "https://cards.scryfall.io/normal/front/e/c/ecbe3339-2cd1-45e2-bac1-8ea995238c30.jpg?1547432743"
  },
  {
    "name": "Velis Vel",
    "text": "Each creature gets +1/+1 for each other creature on the battlefield that shares at least one creature type with it. (For example, if two Elemental Shamans and an Elemental Spirit are on the battlefield, each gets +2/+2.)\nWhenever chaos ensues, target creature gains all creature types until end of turn.",
    "type": "Plane — Lorwyn",
    "image_uri": "https://cards.scryfall.io/normal/front/6/2/621a8224-7ea2-4ca4-be74-e460d05ad12b.jpg?1547432533"
  },
  {
    "name": "Hedron Fields of Agadeem",
    "text": "Creatures with power 7 or greater can't attack or block.\nWhenever chaos ensues, create a 7/7 colorless Eldrazi creature token with annihilator 1. (Whenever it attacks, defending player sacrifices a permanent.)",
    "type": "Plane — Zendikar",
    "image_uri": "https://cards.scryfall.io/normal/front/2/5/2588d0a3-0e63-4976-8fcc-cd6bc52b61aa.jpg?1680815532"
  },
  {
    "name": "Gavony",
    "text": "All creatures have vigilance.\nWhenever chaos ensues, creatures you control gain indestructible until end of turn.",
    "type": "Plane — Innistrad",
    "image_uri": "https://cards.scryfall.io/normal/front/c/b/cb03f60c-d317-4b4c-9747-380abf5fa7ef.jpg?1680815520"
  },
  {
    "name": "Eloren Wilds",
    "text": "Whenever a player taps a permanent for mana, that player adds one mana of any type that permanent produced.\nWhenever chaos ensues, target player can't cast spells until a player planeswalks.",
    "type": "Plane — Shandalar",
    "image_uri": "https://cards.scryfall.io/normal/front/b/e/bec61f7a-cf02-4150-aff9-9465fa14c779.jpg?1547432617"
  },
  {
    "name": "Akoum",
    "text": "Players may cast enchantment spells as though they had flash.\nWhenever chaos ensues, destroy target creature that isn't enchanted.",
    "type": "Plane — Zendikar",
    "image_uri": "https://cards.scryfall.io/normal/front/a/1/a1c7f2eb-0654-46f9-ae3d-11efcac837b8.jpg?1547432330"
  },
  {
    "name": "Kharasha Foothills",
    "text": "Whenever a creature you control attacks a player, for each other opponent, you may create a token that's a copy of that creature, tapped and attacking that opponent. Exile those tokens at the beginning of the next end step.\nWhenever chaos ensues, you may sacrifice any number of creatures. If you do, Kharasha Foothills deals that much damage to target creature.",
    "type": "Plane — Mongseng",
    "image_uri": "https://cards.scryfall.io/normal/front/f/9/f9724517-9e6b-4cb3-a3f7-ea8706f49fe9.jpg?1680815545"
  },
  {
    "name": "Krosa",
    "text": "All creatures get +2/+2.\nWhenever chaos ensues, you may add {W}{U}{B}{R}{G}.",
    "type": "Plane — Dominaria",
    "image_uri": "https://cards.scryfall.io/normal/front/8/6/86b5e553-c871-4750-a839-82b7581c5a2d.jpg?1680815546"
  },
  {
    "name": "Celestine Reef",
    "text": "Creatures without flying or islandwalk can't attack.\nWhenever chaos ensues, until a player planeswalks, you can't lose the game and your opponents can't win the game.",
    "type": "Plane — Luvion",
    "image_uri": "https://cards.scryfall.io/normal/front/0/c/0cf339cb-04c0-40e8-a64c-b80229a32cec.jpg?1547432757"
  },
  {
    "name": "Otaria",
    "text": "Instant and sorcery cards in graveyards have flashback. The flashback cost is equal to the card's mana cost. (Its owner may cast the card from their graveyard for its mana cost. Then they exile it.)\nWhenever chaos ensues, take an extra turn after this one.",
    "type": "Plane — Dominaria",
    "image_uri": "https://cards.scryfall.io/normal/front/3/5/35add85f-a70a-497d-9a11-593325a1a4ef.jpg?1547432456"
  },
  {
    "name": "The Zephyr Maze",
    "text": "Creatures with flying get +2/+0.\nCreatures without flying get -2/-0.\nWhenever chaos ensues, target creature gains flying until end of turn.",
    "type": "Plane — Kyneth",
    "image_uri": "https://cards.scryfall.io/normal/front/4/c/4c9dc306-92e9-46e1-a67c-d4f2a65ce339.jpg?1547432715"
  },
  {
    "name": "The Fertile Lands of Saulvinia",
    "text": "Whenever a player taps a land for mana, that player adds one mana of any type that land produced.\nWhenever chaos ensues, reveal cards from the top of your planar deck until you reveal a plane card. Chaos ensues on that plane. Then put all cards revealed this way on the bottom of your planar deck in any order.",
    "type": "Plane — Antausia",
    "image_uri": "https://cards.scryfall.io/normal/front/f/e/fe2e52fb-4633-46c1-a48a-cde89d709e07.jpg?1680815445"
  },
  {
    "name": "Morphic Tide",
    "text": "When you encounter Morphic Tide, each player shuffles all permanents they own into their library, then reveals that many cards from the top of their library. Each player puts all artifact, creature, land, and planeswalker cards revealed this way onto the battlefield, then does the same for enchantment cards, then puts all cards revealed this way that weren't put onto the battlefield on the bottom of their library in any order. (Then planeswalk away from this phenomenon.)",
    "type": "Phenomenon",
    "image_uri": "https://cards.scryfall.io/normal/front/5/4/54327aa2-319d-4430-a266-03cadeed6146.jpg?1547432267"
  },
  {
    "name": "Prahv",
    "text": "If you cast a spell this turn, you can't attack with creatures.\nIf you attacked with creatures this turn, you can't cast spells.\nWhenever chaos ensues, you gain life equal to the number of cards in your hand.",
    "type": "Plane — Ravnica",
    "image_uri": "https://cards.scryfall.io/normal/front/8/6/86ff49dd-9845-459e-baaf-f65126ccb648.jpg?1547432729"
  },
  {
    "name": "Stensia",
    "text": "Whenever a creature deals damage to one or more players for the first time each turn, put a +1/+1 counter on it.\nWhenever chaos ensues, each creature you control gains \"{T}: This creature deals 1 damage to target player or planeswalker\" until end of turn.",
    "type": "Plane — Innistrad",
    "image_uri": "https://cards.scryfall.io/normal/front/c/3/c31b0240-38c7-4f0b-a851-cbfdfee9d193.jpg?1680815571"
  },
  {
    "name": "Agyrem",
    "text": "Whenever a white creature dies, return it to the battlefield under its owner's control at the beginning of the next end step.\nWhenever a nonwhite creature dies, return it to its owner's hand at the beginning of the next end step.\nWhenever chaos ensues, creatures can't attack you until a player planeswalks.",
    "type": "Plane — Ravnica",
    "image_uri": "https://cards.scryfall.io/normal/front/6/c/6caf8b21-1807-442c-a461-c89c7591df70.jpg?1547432309"
  },
  {
    "name": "The Golden City of Orazca",
    "text": "Ascend (If you control ten or more permanents, you get the city's blessing for the rest of the game.)\nWhenever one or more creatures you control deal combat damage to a player, create a Treasure token. Then draw a card if you have the city's blessing.\nWhenever chaos ensues, you may put a permanent card from your hand onto the battlefield tapped.",
    "type": "Plane — Ixalan",
    "image_uri": "https://cards.scryfall.io/normal/front/0/3/03a2c40d-6adb-4ad7-ba8e-3954d33f0e09.jpg?1680815457"
  },
  {
    "name": "Naar Isle",
    "text": "At the beginning of your upkeep, put a flame counter on Naar Isle, then Naar Isle deals damage to you equal to the number of flame counters on it.\nWhenever chaos ensues, Naar Isle deals 3 damage to target player or planeswalker.",
    "type": "Plane — Wildfire",
    "image_uri": "https://cards.scryfall.io/normal/front/f/6/f63b82f9-ebc4-465c-b25e-5ee710525143.jpg?1547432449"
  },
  {
    "name": "Grove of the Dreampods",
    "text": "When you planeswalk to Grove of the Dreampods and at the beginning of your upkeep, reveal cards from the top of your library until you reveal a creature card. Put that card onto the battlefield and the rest on the bottom of your library in a random order.\nWhenever chaos ensues, return target creature card from your graveyard to the battlefield.",
    "type": "Plane — Fabacin",
    "image_uri": "https://cards.scryfall.io/normal/front/c/2/c2cd3e28-cc48-416d-83d2-74208d2f4aa9.jpg?1680815530"
  },
  {
    "name": "Reality Shaping",
    "text": "When you encounter Reality Shaping, starting with you, each player may put a permanent card from their hand onto the battlefield. (Then planeswalk away from this phenomenon.)",
    "type": "Phenomenon",
    "image_uri": "https://cards.scryfall.io/normal/front/2/0/203c69fe-2ca5-45b2-9be8-e0443733c821.jpg?1680815559"
  },
  {
    "name": "Glimmervoid Basin",
    "text": "Whenever a player casts an instant or sorcery spell with a single target, that player copies that spell for each other spell, permanent, card not on the battlefield, and/or player the spell could target. Each copy targets a different one of them.\nWhenever chaos ensues, choose target creature. Each player except that creature's controller creates a token that's a copy of that creature.",
    "type": "Plane — Mirrodin",
    "image_uri": "https://cards.scryfall.io/normal/front/a/0/a075316c-eb94-46a5-98f2-061b1674186f.jpg?1680815529"
  },
  {
    "name": "The Western Cloud",
    "text": "Prevent all damage that would be dealt to creatures and planeswalkers you control.\nWhenever chaos ensues, create three tapped Treasure tokens. They each deal 1 damage to each creature and each planeswalker.",
    "type": "Plane — Gobakhan",
    "image_uri": "https://cards.scryfall.io/normal/front/4/a/4a0e558d-cfd7-4ecf-b951-50016e8cc569.jpg?1680815506"
  },
  {
    "name": "Esper",
    "text": "Artifact spells cost {1} less to cast.\nWhenever chaos ensues, creatures you control that are white, blue, and/or black become artifacts in addition to their other types until end of turn. Then each artifact creature you control gains vigilance, menace, and lifelink until end of turn.",
    "type": "Plane — Alara",
    "image_uri": "https://cards.scryfall.io/normal/front/f/f/ffdf27d3-80b4-4aa1-b943-d247e502d32c.jpg?1680815445"
  },
  {
    "name": "Unyaro",
    "text": "At the beginning of your end step, if you planeswalked to Unyaro this turn, untap all creatures. They phase out until a player planeswalks. (Treat them and anything attached to them as though they didn't exist.)\nWhenever chaos ensues, create two 2/2 white and blue Knight creature tokens with vigilance.",
    "type": "Plane — Zhalfir",
    "image_uri": "https://cards.scryfall.io/normal/front/6/e/6ef8454d-1aac-4907-91cf-535ea679042c.jpg?1680815503"
  },
  {
    "name": "Quicksilver Sea",
    "text": "When you planeswalk to Quicksilver Sea or at the beginning of your upkeep, scry 4. (Look at the top four cards of your library, then put any number of them on the bottom of your library and the rest on top in any order.)\nWhenever chaos ensues, reveal the top card of your library. You may play it without paying its mana cost.",
    "type": "Plane — Mirrodin",
    "image_uri": "https://cards.scryfall.io/normal/front/0/7/072c1a59-dbdc-469c-9743-e083e52b0b6d.jpg?1547432435"
  },
  {
    "name": "The Dark Barony",
    "text": "Whenever a nonblack card is put into a player's graveyard from anywhere, that player loses 1 life.\nWhenever chaos ensues, each opponent discards a card.",
    "type": "Plane — Ulgrotha",
    "image_uri": "https://cards.scryfall.io/normal/front/0/b/0b8a0cad-92df-45a1-a3cc-561be2f06778.jpg?1547432232"
  },
  {
    "name": "Naya",
    "text": "You may play any number of lands on each of your turns.\nWhenever chaos ensues, target red, green, or white creature you control gets +1/+1 until end of turn for each land you control.",
    "type": "Plane — Alara",
    "image_uri": "https://cards.scryfall.io/normal/front/1/5/15611e29-6f96-4c5c-a919-c8fe590581b0.jpg?1547432519"
  },
  {
    "name": "Skybreen",
    "text": "Players play with the top card of their libraries revealed.\nSpells that share a card type with the top card of a library can't be cast.\nWhenever chaos ensues, target player loses life equal to the number of cards in their hand.",
    "type": "Plane — Kaldheim",
    "image_uri": "https://cards.scryfall.io/normal/front/2/4/24ad1b98-17ef-4c58-a947-384ef39f1193.jpg?1547432246"
  },
  {
    "name": "Valor's Reach",
    "text": "Whenever your team attacks with exactly two creatures, those creatures gain double strike until end of turn.\nWhenever chaos ensues, untap up to two target creatures your team controls. If it's a main phase, there is an additional combat phase after this phase, followed by an additional main phase.",
    "type": "Plane — Kylem",
    "image_uri": "https://cards.scryfall.io/normal/front/4/5/450ed99e-7fb6-45d3-b043-27ff58fe8dbb.jpg?1681017547"
  },
  {
    "name": "Inys Haen",
    "text": "When you planeswalk to Inys Haen and at the beginning of your upkeep, mill three cards.\nWhen you planeswalk away from Inys Haen, each player returns all land cards from their graveyard to the battlefield tapped.\nWhenever chaos ensues, return target nonland card from your graveyard to your hand.",
    "type": "Plane — Cridhe",
    "image_uri": "https://cards.scryfall.io/normal/front/6/a/6a9b4ba6-12cb-488c-b9d5-245e094f72c3.jpg?1680815459"
  },
  {
    "name": "Minamo",
    "text": "Whenever a player casts a spell, that player may draw a card.\nWhenever chaos ensues, each player may return a blue card from their graveyard to their hand.",
    "type": "Plane — Kamigawa",
    "image_uri": "https://cards.scryfall.io/normal/front/9/c/9c155a59-afee-4821-9715-10dafb9f9d9a.jpg?1547432196"
  },
  {
    "name": "Nyx",
    "text": "Nontoken creatures are enchantments in addition to their other types.\nConstellation — Whenever an enchantment enters the battlefield under your control, you gain 1 life.\nWhenever chaos ensues, choose a color. Add an amount of mana of that color equal to your devotion to that color.",
    "type": "Plane — Theros",
    "image_uri": "https://cards.scryfall.io/normal/front/d/8/d8da872d-55e0-4596-ba8e-f9ff7b2c0a86.jpg?1680815480"
  },
  {
    "name": "Glen Elendra",
    "text": "At end of combat, you may exchange control of target creature you control that dealt combat damage to a player this combat and target creature that player controls.\nWhenever chaos ensues, gain control of target creature you own.",
    "type": "Plane — Lorwyn",
    "image_uri": "https://cards.scryfall.io/normal/front/f/d/fdaaef56-0c95-404a-8de5-e8f21e0282d3.jpg?1547432763"
  },
  {
    "name": "The Lux Foundation Library",
    "text": "Players have no maximum hand size.\nWhenever a creature you control deals combat damage to a player, you may draw a card.\nWhenever chaos ensues, put a shadow counter on target creature. (A creature with shadow can block or be blocked by only creatures with shadow.)",
    "type": "Plane — The Library",
    "image_uri": "https://cards.scryfall.io/normal/front/c/3/c3cd9db0-b417-42e8-b3be-00fdc9330014.jpg?1683334203"
  },
  {
    "name": "Onakke Catacomb",
    "text": "All creatures are black and have deathtouch.\nWhenever chaos ensues, creatures you control get +1/+0 and gain first strike until end of turn.",
    "type": "Plane — Shandalar",
    "image_uri": "https://cards.scryfall.io/normal/front/2/e/2eef332f-d47f-4bc3-b39d-572dce4997b2.jpg?1547432470"
  },
  {
    "name": "Chaotic Aether",
    "text": "When you encounter Chaotic Aether, each blank roll of the planar die is a {CHAOS} roll until a player planeswalks away from a plane. (Then planeswalk away from this phenomenon.)",
    "type": "Phenomenon",
    "image_uri": "https://cards.scryfall.io/normal/front/e/6/e6632cd1-aa23-46d0-8e72-0850de4873e1.jpg?1680815517"
  },
  {
    "name": "Orochi Colony",
    "text": "Whenever a creature you control deals combat damage to a player, you may search your library for a basic land card, put it onto the battlefield tapped, then shuffle.\nWhenever chaos ensues, target creature can't be blocked this turn.",
    "type": "Plane — Kamigawa",
    "image_uri": "https://cards.scryfall.io/normal/front/1/2/12655e0d-bb32-4aff-940a-fe14675629ca.jpg?1680815549"
  },
  {
    "name": "Shiv",
    "text": "All creatures have \"{R}: This creature gets +1/+0 until end of turn.\"\nWhenever chaos ensues, create a 5/5 red Dragon creature token with flying.",
    "type": "Plane — Dominaria",
    "image_uri": "https://cards.scryfall.io/normal/front/8/c/8ce18193-76d6-4357-80e3-67ab453f47ac.jpg?1547432547"
  },
  {
    "name": "Nephalia",
    "text": "At the beginning of your end step, mill seven cards. Then return a card at random from your graveyard to your hand.\nWhenever chaos ensues, return target card from your graveyard to your hand.",
    "type": "Plane — Innistrad",
    "image_uri": "https://cards.scryfall.io/normal/front/9/f/9f4b51ac-3e56-494f-aad7-ff5b0c3ed6ed.jpg?1547432372"
  },
  {
    "name": "Interplanar Tunnel",
    "text": "When you encounter Interplanar Tunnel, reveal cards from the top of your planar deck until you reveal five plane cards. Put a plane card from among them on top of your planar deck, then put the rest of the revealed cards on the bottom in a random order. (Then planeswalk away from this phenomenon.)",
    "type": "Phenomenon",
    "image_uri": "https://cards.scryfall.io/normal/front/5/6/56e4874c-9d3d-4a1c-a027-186a33ce0da7.jpg?1547432164"
  },
  {
    "name": "Stairs to Infinity",
    "text": "Players have no maximum hand size.\nWhenever you roll the planar die, draw a card.\nWhenever chaos ensues, reveal the top card of your planar deck. You may put it on the bottom of your planar deck.",
    "type": "Plane — Xerex",
    "image_uri": "https://cards.scryfall.io/normal/front/e/c/eceba6df-8821-499b-b3c2-4d54c6eab257.jpg?1547432680"
  },
  {
    "name": "Astral Arena",
    "text": "No more than one creature can attack each combat.\nNo more than one creature can block each combat.\nWhenever chaos ensues, Astral Arena deals 2 damage to each creature.",
    "type": "Plane — Kolbahan",
    "image_uri": "https://cards.scryfall.io/normal/front/5/6/56c735c0-9346-431b-869f-3accfa193016.jpg?1547432337"
  },
  {
    "name": "Fields of Summer",
    "text": "Whenever a player casts a spell, that player may gain 2 life.\nWhenever chaos ensues, you may gain 10 life.",
    "type": "Plane — Moag",
    "image_uri": "https://cards.scryfall.io/normal/front/b/5/b52a233b-cc51-4f3e-94d0-a4b75ecb248e.jpg?1547432568"
  },
  {
    "name": "Bant",
    "text": "All creatures have exalted. (Whenever a creature attacks alone, it gets +1/+1 until end of turn for each instance of exalted among permanents its controller controls.)\nWhenever chaos ensues, put a divinity counter on target green, white, or blue creature. That creature has indestructible for as long as it has a divinity counter on it.",
    "type": "Plane — Alara",
    "image_uri": "https://cards.scryfall.io/normal/front/4/3/434a2d09-5776-4168-b863-f3b0a736d19b.jpg?1547432701"
  },
  {
    "name": "Lethe Lake",
    "text": "At the beginning of your upkeep, mill ten cards.\nWhenever chaos ensues, target player mills ten cards.",
    "type": "Plane — Arkhos",
    "image_uri": "https://cards.scryfall.io/normal/front/7/a/7a049235-2fda-48a7-b46e-d150a4893397.jpg?1547432694"
  },
  {
    "name": "The Caldaia",
    "text": "Creature spells you cast from your hand have blitz {3}. (If you cast a spell for its blitz cost, it gains haste and \"When this creature dies, draw a card.\" Sacrifice it at the beginning of the next end step.)\nWhenever chaos ensues, return target creature card from your graveyard to your hand.",
    "type": "Plane — Capenna",
    "image_uri": "https://cards.scryfall.io/normal/front/d/e/de4c566d-85ef-49af-a5cb-bcfa4aaba245.jpg?1680815444"
  },
  {
    "name": "The Great Forest",
    "text": "Each creature assigns combat damage equal to its toughness rather than its power.\nWhenever chaos ensues, creatures you control get +0/+2 and gain trample until end of turn.",
    "type": "Plane — Lorwyn",
    "image_uri": "https://cards.scryfall.io/normal/front/0/4/04075c37-1c1c-439c-9c54-770185fc0af1.jpg?1680815530"
  },
  {
    "name": "The Aether Flues",
    "text": "When you planeswalk to The Aether Flues and at the beginning of your upkeep, you may sacrifice a creature. If you do, reveal cards from the top of your library until you reveal a creature card, put that card onto the battlefield, then shuffle all other cards revealed this way into your library.\nWhenever chaos ensues, you may put a creature card from your hand onto the battlefield.",
    "type": "Plane — Iquatana",
    "image_uri": "https://cards.scryfall.io/normal/front/a/2/a22dfe5f-82cc-4d99-b454-82157ffd6a59.jpg?1680815515"
  },
  {
    "name": "Riptide Island",
    "text": "When you planeswalk to Riptide Island and at the beginning of your upkeep, create two 1/1 colorless Sliver creature tokens.\nWhenever chaos ensues, Slivers you control gain haste and get +X/+X until end of turn, where X is the number of Slivers you control.",
    "type": "Plane — Dominaria",
    "image_uri": "https://cards.scryfall.io/normal/front/6/1/618dbae8-7e3f-47ba-8f02-292047e86a05.jpg?1680815489"
  },
  {
    "name": "Enigma Ridges",
    "text": "When you planeswalk to Enigma Ridges, each player who controls fewer lands than the player who controls the most lands searches their library for a number of basic land cards less than or equal to the difference, reveals them, puts them into their hand, then shuffles.\nWhenever chaos ensues, draw a card, then you may put a land card from your hand onto the battlefield.",
    "type": "Plane — Echoir",
    "image_uri": "https://cards.scryfall.io/normal/front/a/4/a4400c14-2aed-4018-a3fb-7de2b0456c07.jpg?1680815445"
  },
  {
    "name": "Tazeem",
    "text": "Creatures can't block.\nWhenever chaos ensues, draw a card for each land you control.",
    "type": "Plane — Zendikar",
    "image_uri": "https://cards.scryfall.io/normal/front/1/8/18c94ada-d864-4e94-9d95-e796ab0d0cff.jpg?1547432498"
  },
  {
    "name": "Jund",
    "text": "Whenever a player casts a creature spell that's black, red, or green, it gains devour 5. (As the creature enters the battlefield, its controller may sacrifice any number of creatures. The creature enters the battlefield with five times that many +1/+1 counters on it.)\nWhenever chaos ensues, create two 1/1 red Goblin creature tokens.",
    "type": "Plane — Alara",
    "image_uri": "https://cards.scryfall.io/normal/front/5/8/585fde63-4cb5-4235-8c95-2a7a511e7c3f.jpg?1680815543"
  },
  {
    "name": "Norn's Dominion",
    "text": "When you planeswalk away from Norn's Dominion, destroy each nonland permanent without a fate counter on it, then remove all fate counters from all permanents.\nWhenever chaos ensues, you may put a fate counter on target permanent.",
    "type": "Plane — New Phyrexia",
    "image_uri": "https://cards.scryfall.io/normal/front/2/0/20d23638-74fb-481d-a3c4-d7f5fd666211.jpg?1547432295"
  },
  {
    "name": "The Eon Fog",
    "text": "Players skip their untap steps.\nWhenever chaos ensues, untap all permanents you control.",
    "type": "Plane — Equilor",
    "image_uri": "https://cards.scryfall.io/normal/front/5/0/501268b6-878b-4725-be1f-a64c90f79b87.jpg?1547432575"
  },
  {
    "name": "Ten Wizards Mountain",
    "text": "Whenever you roll the planar die, put a +1/+1 counter on up to one target creature.\nWhenever chaos ensues, creatures you control gain flying until end of turn.",
    "type": "Plane — Shenmeng",
    "image_uri": "https://cards.scryfall.io/normal/front/d/2/d2603e7a-1b1b-4f71-81d9-7e84c766312d.jpg?1680815497"
  },
  {
    "name": "Naktamun",
    "text": "Each creature card in your graveyard has embalm. Its embalm cost is equal to its mana cost. (Exile a creature card from your graveyard and pay its embalm cost: Create a token that's a copy of it, except it's a white Zombie in addition to its other types with no mana cost. Embalm only as a sorcery.)\nWhenever chaos ensues, you may discard a card. If you do, draw a card.",
    "type": "Plane — Amonkhet",
    "image_uri": "https://cards.scryfall.io/normal/front/7/f/7ff092bb-e284-4397-a584-6a046145424b.jpg?1680815473"
  },
  {
    "name": "Planewide Disaster",
    "text": "When you encounter Planewide Disaster, destroy all creatures. (Then planeswalk away from this phenomenon.)",
    "type": "Phenomenon",
    "image_uri": "https://cards.scryfall.io/normal/front/0/5/0518b7a0-3bbb-4802-9faf-3f4256671e9e.jpg?1680815558"
  },
  {
    "name": "Ghirapur",
    "text": "At the beginning of combat on your turn, until end of turn, each noncreature, non-Vehicle artifact you control becomes a 5/3 Vehicle in addition to its other types and gains trample, haste, and crew 2.\nWhenever chaos ensues, return target noncreature artifact card from your graveyard to your hand.",
    "type": "Plane — Kaladesh",
    "image_uri": "https://cards.scryfall.io/normal/front/0/c/0c8456bd-d290-43af-b2b9-06823bab65a2.jpg?1681019040"
  },
  {
    "name": "Spatial Merging",
    "text": "When you encounter Spatial Merging, reveal cards from the top of your planar deck until you reveal two plane cards. Simultaneously planeswalk to both of them. Put all other cards revealed this way on the bottom of your planar deck in any order.",
    "type": "Phenomenon",
    "image_uri": "https://cards.scryfall.io/normal/front/a/c/ac3d5e6a-64e6-4888-915f-874109e7830a.jpg?1680815571"
  },
  {
    "name": "Norn's Seedcore",
    "text": "When you planeswalk to Norn's Seedcore, chaos ensues.\nWhenever chaos ensues, reveal cards from the top of your planar deck until you reveal a plane card. Planeswalk to it, except don't planeswalk away from any plane. Put the rest of the revealed cards on the bottom of your planar deck in any order.",
    "type": "Plane — New Phyrexia",
    "image_uri": "https://cards.scryfall.io/normal/front/1/a/1a4238ce-2a8f-404f-a893-9bb8b3f26835.jpg?1680815475"
  },
  {
    "name": "Lair of the Ashen Idol",
    "text": "At the beginning of your upkeep, sacrifice a creature. If you can't, planeswalk.\nWhenever chaos ensues, any number of target players each create a 2/2 black Zombie creature token.",
    "type": "Plane — Azgol",
    "image_uri": "https://cards.scryfall.io/normal/front/b/6/b6078774-f681-46dd-a68e-1cefa8261d16.jpg?1547432736"
  },
  {
    "name": "Feeding Grounds",
    "text": "Red spells cost {1} less to cast.\nGreen spells cost {1} less to cast.\nWhenever chaos ensues, put X +1/+1 counters on target creature, where X is that creature's mana value.",
    "type": "Plane — Muraganda",
    "image_uri": "https://cards.scryfall.io/normal/front/1/d/1dde33fa-f748-43c9-9ead-9461332e9e67.jpg?1547432400"
  },
  {
    "name": "Cliffside Market",
    "text": "When you planeswalk to Cliffside Market or at the beginning of your upkeep, you may exchange life totals with target player.\nWhenever chaos ensues, exchange control of two target permanents that share a card type.",
    "type": "Plane — Mercadia",
    "image_uri": "https://cards.scryfall.io/normal/front/f/f/ff65643b-e8bb-49d6-8887-13a146ee5174.jpg?1547432708"
  },
  {
    "name": "Trail of the Mage-Rings",
    "text": "Instant and sorcery spells have rebound. (The spell's controller exiles the spell as it resolves if they cast it from their hand. At the beginning of that player's next upkeep, they may cast that card from exile without paying its mana cost.)\nWhenever chaos ensues, you may search your library for an instant or sorcery card, reveal it, put it into your hand, then shuffle.",
    "type": "Plane — Vryn",
    "image_uri": "https://cards.scryfall.io/normal/front/f/5/f5f307bf-80ac-46cb-9003-3e70a0703e71.jpg?1547432442"
  },
  {
    "name": "Raven's Run",
    "text": "All creatures have wither. (They deal damage to creatures in the form of -1/-1 counters.)\nWhenever chaos ensues, put a -1/-1 counter on target creature, two -1/-1 counters on another target creature, and three -1/-1 counters on a third target creature.",
    "type": "Plane — Shadowmoor",
    "image_uri": "https://cards.scryfall.io/normal/front/d/e/de770524-9afc-4971-842a-6ee0b81176fb.jpg?1547432477"
  },
  {
    "name": "Kessig",
    "text": "Prevent all combat damage that would be dealt by non-Werewolf creatures.\nWhenever chaos ensues, each creature you control gets +2/+2, gains trample, and becomes a Werewolf in addition to its other types until end of turn.",
    "type": "Plane — Innistrad",
    "image_uri": "https://cards.scryfall.io/normal/front/5/2/5271d8fd-3657-45a3-8147-00cc1d19425f.jpg?1547432218"
  },
  {
    "name": "The Pit",
    "text": "When you planeswalk to The Pit, each player creates their choice of a 3/3 white Angel creature token with flying or a 6/6 black Demon creature token with flying, trample, and \"At the beginning of your upkeep, sacrifice another creature. If you can't, this creature deals 6 damage to you.\"\nWhenever chaos ensues, each player sacrifices a nonartifact creature.",
    "type": "Plane — The Abyss",
    "image_uri": "https://cards.scryfall.io/normal/front/f/d/fd571dc7-b0b0-49a2-938a-d4336efe5e76.jpg?1680815488"
  },
  {
    "name": "Mirrored Depths",
    "text": "Whenever a player casts a spell, that player flips a coin. If the player loses the flip, counter that spell.\nWhenever chaos ensues, target player reveals the top card of their library. If it's a nonland card, you may cast it without paying its mana cost.",
    "type": "Plane — Karsus",
    "image_uri": "https://cards.scryfall.io/normal/front/d/7/d7a2b02e-3ff2-4c71-9022-b08472f53664.jpg?1547432351"
  },
  {
    "name": "Tember City",
    "text": "Whenever a player taps a land for mana, Tember City deals 1 damage to that player.\nWhenever chaos ensues, each other player sacrifices a nonland permanent.",
    "type": "Plane — Kinshala",
    "image_uri": "https://cards.scryfall.io/normal/front/e/c/ec65904f-c0dd-45ab-a85a-af4a6a631e11.jpg?1547432749"
  },
  {
    "name": "Sokenzan",
    "text": "All creatures get +1/+1 and have haste.\nWhenever chaos ensues, untap all creatures that attacked this turn. If it's a main phase, there is an additional combat phase after this phase, followed by an additional main phase.",
    "type": "Plane — Kamigawa",
    "image_uri": "https://cards.scryfall.io/normal/front/a/7/a70f7633-0851-4205-a736-3b11d4823f10.jpg?1680815565"
  },
  {
    "name": "Paliano",
    "text": "When one or more creatures you control deal combat damage to a player, if there is no monarch, you become the monarch.\nWhenever chaos ensues, create a 1/1 black Assassin creature token with deathtouch and haste.",
    "type": "Plane — Fiora",
    "image_uri": "https://cards.scryfall.io/normal/front/f/e/fe509cef-83e5-48d9-a9ec-e187ab65b5e0.jpg?1680815487"
  },
  {
    "name": "Orzhova",
    "text": "When you planeswalk away from Orzhova, each player returns all creature cards from their graveyard to the battlefield.\nWhenever chaos ensues, for each opponent, exile up to one target creature card from that player's graveyard.",
    "type": "Plane — Ravnica",
    "image_uri": "https://cards.scryfall.io/normal/front/b/e/be92be0a-e10d-478b-bc09-9cd09bfb269e.jpg?1547432253"
  },
  {
    "name": "Talon Gates",
    "text": "Any time you could cast a sorcery, you may exile a nonland card from your hand with X time counters on it, where X is its mana value. If the exiled card doesn't have suspend, it gains suspend. (At the beginning of its owner's upkeep, they remove a time counter. When the last is removed, the player casts it without paying its mana cost. If it's a creature, it has haste.)\nWhenever chaos ensues, remove two time counters from each suspended card you own.",
    "type": "Plane — Dominaria",
    "image_uri": "https://cards.scryfall.io/normal/front/0/9/09feed09-96de-4208-b6b9-cac0ec150e70.jpg?1547432225"
  },
  {
    "name": "Mutual Epiphany",
    "text": "When you encounter Mutual Epiphany, each player draws four cards. (Then planeswalk away from this phenomenon.)",
    "type": "Phenomenon",
    "image_uri": "https://cards.scryfall.io/normal/front/b/e/be4da23c-bc51-4601-8f86-4e6f4eb27e6a.jpg?1680815547"
  },
  {
    "name": "Megaflora Jungle",
    "text": "Each creature with mana value 2 or less gets +2/+2.\nWhenever chaos ensues, create a 1/1 green Insect creature token with flying named Butterfly.",
    "type": "Plane — Gargantikar",
    "image_uri": "https://cards.scryfall.io/normal/front/5/3/53f91325-e95a-4b68-9491-4249c2e940b4.jpg?1681019079"
  },
  {
    "name": "Edge of Malacol",
    "text": "If a creature you control would untap during your untap step, put two +1/+1 counters on it instead.\nWhenever chaos ensues, untap each creature you control.",
    "type": "Plane — Belenon",
    "image_uri": "https://cards.scryfall.io/normal/front/c/a/ca4c429a-ca40-4656-aea5-86eb450e47b7.jpg?1547432589"
  },
  {
    "name": "The Wilds",
    "text": "When you planeswalk to The Wilds and at the beginning of your upkeep, create a Food token.\nWhenever chaos ensues, target player sacrifices a creature. If they do, you create a Food token. You create two Food tokens instead if the sacrificed creature's toughness was 4 or greater.",
    "type": "Plane — Eldraine",
    "image_uri": "https://cards.scryfall.io/normal/front/1/f/1fccd76c-cce9-4ae3-84c1-000e54ca4734.jpg?1680815512"
  },
  {
    "name": "Panopticon",
    "text": "When you planeswalk to Panopticon, draw a card.\nAt the beginning of your draw step, draw an additional card.\nWhenever chaos ensues, draw a card.",
    "type": "Plane — Mirrodin",
    "image_uri": "https://cards.scryfall.io/normal/front/e/c/ecab1a2d-a47a-4572-a133-aca40384a908.jpg?1680815558"
  },
  {
    "name": "The Hippodrome",
    "text": "All creatures get -5/-0.\nWhenever chaos ensues, you may destroy target creature if its power is 0 or less.",
    "type": "Plane — Segovia",
    "image_uri": "https://cards.scryfall.io/normal/front/4/b/4ba7ce8f-e11d-4e06-8cb6-668de2a43a4e.jpg?1547432288"
  },
  {
    "name": "Bloodhill Bastion",
    "text": "Whenever a creature enters the battlefield, it gains double strike and haste until end of turn.\nWhenever chaos ensues, exile target nontoken creature you control, then return it to the battlefield under your control.",
    "type": "Plane — Equilor",
    "image_uri": "https://cards.scryfall.io/normal/front/9/9/9944763b-07b1-447d-b07c-b585ec00e883.jpg?1680815516"
  },
  {
    "name": "Aretopolis",
    "text": "When you planeswalk to Aretopolis or at the beginning of your upkeep, put a scroll counter on Aretopolis, then you gain life equal to the number of scroll counters on it.\nWhen Aretopolis has ten or more scroll counters on it, planeswalk.\nWhenever chaos ensues, put a scroll counter on Aretopolis, then draw cards equal to the number of scroll counters on it.",
    "type": "Plane — Kephalai",
    "image_uri": "https://cards.scryfall.io/normal/front/d/6/d6dc655e-d8ef-443a-bb3e-46c7ca1555ba.jpg?1547432302"
  },
  {
    "name": "Truga Jungle",
    "text": "All lands have \"{T}: Add one mana of any color.\"\nWhenever chaos ensues, reveal the top three cards of your library. Put all land cards revealed this way into your hand and the rest on the bottom of your library in any order.",
    "type": "Plane — Ergamon",
    "image_uri": "https://cards.scryfall.io/normal/front/b/d/bd6aa726-9979-42a5-a9ad-5c3f40b599ae.jpg?1680815578"
  },
  {
    "name": "Takenuma",
    "text": "Whenever a creature leaves the battlefield, its controller draws a card.\nWhenever chaos ensues, return target creature you control to its owner's hand.",
    "type": "Plane — Kamigawa",
    "image_uri": "https://cards.scryfall.io/normal/front/0/d/0dadba2e-1d9a-4f04-b9d5-a3edff017662.jpg?1547432652"
  },
  {
    "name": "Mount Keralia",
    "text": "At the beginning of your end step, put a pressure counter on Mount Keralia.\nWhen you planeswalk away from Mount Keralia, it deals damage equal to the number of pressure counters on it to each creature and each planeswalker.\nWhenever chaos ensues, prevent all damage that planes named Mount Keralia would deal this game to permanents you control.",
    "type": "Plane — Regatha",
    "image_uri": "https://cards.scryfall.io/normal/front/a/4/a4d3edeb-4a78-4de3-a167-4565c494ba23.jpg?1547432596"
  },
  {
    "name": "Time Distortion",
    "text": "When you encounter Time Distortion, reverse the game's turn order. (For example, if play had proceeded clockwise around the table, it now goes counterclockwise. Then planeswalk away from this phenomenon.)",
    "type": "Phenomenon",
    "image_uri": "https://cards.scryfall.io/normal/front/b/a/ba38fb01-ea16-4a2d-964a-41f7b4d74024.jpg?1547432189"
  },
  {
    "name": "The Maelstrom",
    "text": "When you planeswalk to The Maelstrom or at the beginning of your upkeep, you may reveal the top card of your library. If it's a permanent card, you may put it onto the battlefield. If you revealed a card but didn't put it onto the battlefield, put it on the bottom of your library.\nWhenever chaos ensues, return target permanent card from your graveyard to the battlefield.",
    "type": "Plane — Alara",
    "image_uri": "https://cards.scryfall.io/normal/front/6/2/6223caca-e993-4834-a673-3eee65b8afe1.jpg?1547432561"
  },
  {
    "name": "Windriddle Palaces",
    "text": "Players play with the top card of their libraries revealed.\nYou may play lands and cast spells from the top of any player's library.\nWhenever chaos ensues, each player mills a card.",
    "type": "Plane — Belenon",
    "image_uri": "https://cards.scryfall.io/normal/front/2/7/27f3c16a-34f9-497d-835c-5942e395ded8.jpg?1591196076"
  },
  {
    "name": "Izzet Steam Maze",
    "text": "Whenever a player casts an instant or sorcery spell, that player copies it. The player may choose new targets for the copy.\nWhenever chaos ensues, instant and sorcery spells you cast this turn cost {3} less to cast.",
    "type": "Plane — Ravnica",
    "image_uri": "https://cards.scryfall.io/normal/front/d/0/d01d1b4f-5ac5-40b0-b4ad-34ac70aeb488.jpg?1547432427"
  },
  {
    "name": "Immersturm",
    "text": "Whenever a creature enters the battlefield, that creature's controller may have it deal damage equal to its power to any target of their choice.\nWhenever chaos ensues, exile target creature, then return it to the battlefield under its owner's control.",
    "type": "Plane — Valla",
    "image_uri": "https://cards.scryfall.io/normal/front/d/4/d44a959c-7a04-4342-8827-882349f786fc.jpg?1547432603"
  },
  {
    "name": "Sea of Sand",
    "text": "Players reveal each card they draw.\nWhenever a player draws a land card, that player gains 3 life.\nWhenever a player draws a nonland card, that player loses 3 life.\nWhenever chaos ensues, put target permanent on top of its owner's library.",
    "type": "Plane — Rabiah",
    "image_uri": "https://cards.scryfall.io/normal/front/0/6/0693024b-7eed-4aa5-a890-66c947db6b73.jpg?1547432420"
  },
  {
    "name": "Isle of Vesuva",
    "text": "Whenever a nontoken creature enters the battlefield, its controller creates a token that's a copy of that creature.\nWhenever chaos ensues, destroy target creature and all other creatures with the same name as that creature.",
    "type": "Plane — Dominaria",
    "image_uri": "https://cards.scryfall.io/normal/front/5/f/5fa27faa-f72c-4925-8ad5-c984113245bf.jpg?1680815534"
  },
  {
    "name": "Sanctum of Serra",
    "text": "When you planeswalk away from Sanctum of Serra, destroy all nonland permanents.\nWhenever chaos ensues, you may have your life total become 20.",
    "type": "Plane — Serra’s Realm",
    "image_uri": "https://cards.scryfall.io/normal/front/4/c/4c20e1cd-c541-4b44-8e20-adaa45a989a2.jpg?1547432463"
  },
  {
    "name": "Goldmeadow",
    "text": "Whenever a land enters the battlefield, that land's controller creates three 0/1 white Goat creature tokens.\nWhenever chaos ensues, create a 0/1 white Goat creature token.",
    "type": "Plane — Lorwyn",
    "image_uri": "https://cards.scryfall.io/normal/front/8/3/830c7c81-335e-4f0b-81b9-209732408093.jpg?1547432666"
  },
  {
    "name": "Pools of Becoming",
    "text": "At the beginning of your end step, put the cards in your hand on the bottom of your library in any order, then draw that many cards.\nWhenever chaos ensues, reveal the top three cards of your planar deck. Each of the revealed cards' {CHAOS} abilities triggers. Then put the revealed cards on the bottom of your planar deck in any order.",
    "type": "Plane — Bolas's Meditation Realm",
    "image_uri": "https://cards.scryfall.io/normal/front/5/5/559007a6-c515-413a-8d3c-8ce1df0742ff.jpg?1547432526"
  },
  {
    "name": "Ketria",
    "text": "When you planeswalk to Ketria and at the beginning of your upkeep, put your choice of a vigilance, menace, or trample counter on target creature you control.\nWhenever chaos ensues, exile cards from the top of your library until you exile a nonland permanent card. Put that card onto the battlefield or into your hand.",
    "type": "Plane — Ikoria",
    "image_uri": "https://cards.scryfall.io/normal/front/8/d/8d63dc8a-101c-4b12-bf56-06a8a3cea64e.jpg?1680815461"
  },
  {
    "name": "Undercity Reaches",
    "text": "Whenever a creature deals combat damage to a player, its controller may draw a card.\nWhenever chaos ensues, you have no maximum hand size for the rest of the game.",
    "type": "Plane — Ravnica",
    "image_uri": "https://cards.scryfall.io/normal/front/8/7/87a6b20d-93f8-4af4-936c-11606e9efd87.jpg?1680815584"
  },
  {
    "name": "Grand Ossuary",
    "text": "Whenever a creature dies, its controller distributes a number of +1/+1 counters equal to its power among any number of target creatures they control.\nWhenever chaos ensues, each player exiles all creatures they control and creates X 1/1 green Saproling creature tokens, where X is the total power of the creatures they exiled this way. Then planeswalk.",
    "type": "Plane — Ravnica",
    "image_uri": "https://cards.scryfall.io/normal/front/3/d/3dfccef2-4d55-423f-8375-4e349bbf615e.jpg?1547432407"
  },
  {
    "name": "Kilnspire District",
    "text": "When you planeswalk to Kilnspire District or at the beginning of your precombat main phase, put a charge counter on Kilnspire District, then add {R} for each charge counter on it.\nWhenever chaos ensues, you may pay {X}. If you do, Kilnspire District deals X damage to any target.",
    "type": "Plane — Ravnica",
    "image_uri": "https://cards.scryfall.io/normal/front/9/3/93f386a5-08ce-4f76-944f-f38620a41027.jpg?1547432540"
  },
  {
    "name": "Stronghold Furnace",
    "text": "If a source would deal damage to a permanent or player, it deals double that damage instead.\nWhenever chaos ensues, Stronghold Furnace deals 1 damage to any target.",
    "type": "Plane — Rath",
    "image_uri": "https://cards.scryfall.io/normal/front/0/f/0ff946f3-a536-4b35-b953-e66667314afa.jpg?1680815573"
  }
]